Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
/*out_pattern_gen related functions*/
/**
 * @brief Handler for out pattern generation done.
 * @param out_gen_state State from which handler is called.
 */
void out_gen_done_handler(uint32_t out_gen_state);

/*Light Sense related functions*/
/**
 * @brief Function to get required data to initialize the led_sense module
 */
void light_sense_init(void);
/**
 * @brief Function to enable or disable light_sense according to conditions
 * @param state if true enable the light_sense if false disable the light_sense
 */
void light_sense_set_state(bool state);
/**
 * @brief Function which will check light intensity and compare it to 
 * current operational mode sent as parameter.
 * @param oper_time value for which we need to check light conditions
 * @return true if light intensity satisfies given conditions
 * @return false if light intensity doesn't satisfies given condition
 */
bool light_sense_light_check(oper_time_t oper_time);

/*Module manager related function*/
//Module manager is part of program which will enable or disable the 
//PIR or timer at start event, add_ticks event and stop event
/**
 * @brief Function to check light and working mode conditions.
 * according to conditions respective peripheral device will be
 * enabled or disabled.
 */
void module_manager_start_check(void);
/**
 * @brief Function to disable all peripheral device used in this module.
 */
void module_manager_disable_all(void);

/**
 * @brief Functions to generate out_gen_config according to selected camera
 * trigger mode.
 * @{
 */
/**
 * @brief Function to click one shot per trigger
 * @param data_process_mode mode for which we have to generate the out_gen_config
 */
void out_gen_config_single_shot(cam_trig_state_t data_process_mode);
/**
 * @brief Function to click multiple shots per trigger
 * @param data_process_mode mode for which we have to generate the out_gen_config
 * @param burst_duration Time duration between two shots
 * @param burst_num Number of shots per trigger
 */
void out_gen_config_multi_shot(cam_trig_state_t data_process_mode, 
                     uint32_t burst_duration, uint32_t burst_num);
/**
 * @brief Function to take photo in bulb mode.
 * @param data_process_mode mode for which we have to generate the out_gen_config
 * @param bulb_time Time duration for half press signal
 */
void out_gen_config_bulb_expo(cam_trig_state_t data_process_mode, uint32_t bulb_time);
/**
 * @brief Function to do focus only
 * @param data_process_mode mode for which we have to generate the out_gen_config
 */
void out_gen_config_focus_only(cam_trig_state_t data_process_mode);
/**
 * @brief Dummy mode which will do nothing i.e keep the signals high
 * @param data_process_mode mode for which we have to generate the out_gen_config
 */
void out_gen_config_none(cam_trig_state_t data_process_mode);
//Suggest some good name for this function.
/**
 * @brief Function to create out_gen_config for the video length for which
 * PIR will be enabled and if no motion is detected during this time video will
 * end
 */
void out_gen_config_part_video_end();
/**
 * @brief Function to generate out_gen_config required for extension length
 * @param extn_len Extension length provided by application in sec.
 */
void out_gen_config_part_video_extn(uint32_t extn_len);
/**
 * @brief Function to generate out_gen_config required to start a video after PIR
 * triggering with length=video_len-@ref VIDEO_PIR_ON.
 * @param video_len Length of the video without any extensions
 */
void out_gen_config_part_video_start(uint32_t video_len);
/**
 * @brief Function to record video of fix length on Timer Triggering
 * @param data_process_mode mode for which we have to generate the out_gen_config
 * @param video_len Video Length in sec.
 */
void out_gen_config_full_video(cam_trig_state_t data_process_mode, uint32_t video_len);

//function definitions
/**
 * @brief Function to print expected pattern output from out_gen_pattern
 * @param next Array of expected states
 * @param str Comment to describe for which we are printing the array.
 */
void debug_print_bool_array(bool (* next)[OUT_GEN_MAX_TRANSITIONS], char * str)
{
#if DEBUG_PRINT
    log_printf("%s\n", str);
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; arr_p<OUT_GEN_MAX_TRANSITIONS; arr_p++)
        {
            log_printf("%x ", next[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
#endif
}

void pir_set_state(bool state)
{
    log_printf("%s %x\n",__func__, state);
    if(state == true)
    {
        pir_sense_start(&config_pir);        
    }
    else
    {
        pir_sense_stop();    
    }
}

void pir_handler(int32_t adc_val)
{
    log_printf("%s", __func__);
    log_printf(" %d\n", adc_val);
    pir_set_state(false);
    if(out_gen_is_on() == false)
    {
        if(sense_feedback == true)
        {
            led_ui_single_start(LED_SEQ_PIR_PULSE, LED_UI_HIGH_PRIORITY, true);
        }
        out_gen_start(&out_gen_config[PIR_IDLE]);
    }
}

void pir_handler_video(int32_t adc_val)
{
    log_printf("%s", __func__);
    log_printf(" %d\n", adc_val);
    pir_set_state(false);
    static uint32_t no_of_extn_remain;
    if(out_gen_is_on() == false)
    {
        if(sense_feedback == true)
        {
            led_ui_single_start(LED_SEQ_PIR_PULSE, LED_UI_HIGH_PRIORITY, true);
        }
        no_of_extn_remain = NO_OF_VIDEO_EXTN_ALLOWED;
        out_gen_start(&out_gen_config[PIR_IDLE]);
    }
    else if(no_of_extn_remain > 0)
    {
        uint32_t ticks_done = out_gen_get_ticks ();
        if(ticks_done < video_extn_ticks)
        {
            out_gen_config[VIDEO_ETXN_CONFIG].transitions_durations[0] = 
                (video_extn_ticks  - ticks_done);
        }
        else
        {
            out_gen_config[VIDEO_ETXN_CONFIG].transitions_durations[0] = 
                video_extn_ticks;
        }
        out_gen_start(&out_gen_config[VIDEO_ETXN_CONFIG]);
        no_of_extn_remain--;
    }
}

void out_gen_config_updater_pir()
{
    uint32_t config_mode = config.config_sensepi->pir_conf.mode;
    uint32_t mode = ((config_mode & MODE_MSK) 
            >> (MODE_POS * SIZE_OF_BYTE));
    uint32_t input1 = ((config_mode & INPUT1_MSK) 
            >> (INPUT1_POS * SIZE_OF_BYTE));
    uint32_t input2 = ((config_mode & INPUT2_MSK) 
            >> (INPUT2_POS * SIZE_OF_BYTE));
    uint32_t single_input = config_mode>> (INPUT1_POS * SIZE_OF_BYTE);
    switch((operational_mode_t)mode)
    {
        case MODE_SINGLE_SHOT:
        {
            out_gen_config_single_shot(PIR_IDLE);
            break;
        }
        case MODE_MULTISHOT:
        {
            out_gen_config_multi_shot(PIR_IDLE, input1, input2);
            break;
        }
        case MODE_BULB :
        {
            //Using both input 1 and input 2
            out_gen_config_bulb_expo(PIR_IDLE, single_input);
            break;
        }
        case MODE_VIDEO :
        {
            if(input2 == 0)
            {
                out_gen_config_full_video (PIR_IDLE, input1);
            }
            else
            {
                out_gen_config_part_video_start(input1);
                out_gen_config_part_video_extn(input2);
                out_gen_config_part_video_end(input2);
            }
            break;
        }
        case MODE_FOCUS :
        {
            out_gen_config_focus_only(PIR_IDLE);
            break;
        }
        case MODE_NONE:
        {
            out_gen_config_none(PIR_IDLE);
        }
    }   
}

void timer_set_state(bool state)
{
    if(state == true)
    {
        if(ms_timer_get_on_status (SENSEPI_CAM_TRIGGER_MS_TIMER_USED) == false)
        {
            ms_timer_start(SENSEPI_CAM_TRIGGER_MS_TIMER_USED, MS_REPEATED_CALL,
               MS_TIMER_TICKS_MS(config.config_sensepi->timer_conf.timer_interval * 100),
               timer_handler);
        }
    }
    else
    {
        ms_timer_stop(SENSEPI_CAM_TRIGGER_MS_TIMER_USED);
    }
}

void timer_handler()
{
    if(out_gen_is_on () == false)
    {
        out_gen_start(&out_gen_config[TIMER_IDLE]);
    }
}

