Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
    for(uint32_t i = 0; i< burst_num; i++)
    {
        memcpy(local_out_gen_config.transitions_durations + i*SINGLE_SHOT_TRANSITIONS,
                repeat_delay_array, SINGLE_SHOT_TRANSITIONS*sizeof(uint32_t));

        for(uint32_t j = 0; j < NUM_PIN_OUT; j++)
        {
            memcpy(*(local_out_gen_config.next_out +j),*(multishot_generic + j),
                    burst_num* SINGLE_SHOT_TRANSITIONS*sizeof(bool));
            //An extra '1' at the end for the remaining of the inter-trigger time
            local_out_gen_config.next_out[j][burst_num* SINGLE_SHOT_TRANSITIONS] = 1;
        }
    }

    if(data_process_mode == PIR_IDLE)
    {
        time_remain = MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100)
            - SINGLE_SHOT_DURATION*burst_num -
            (MS_TIMER_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION)*(burst_num - 1);  
        if((int32_t)time_remain <= 0)
        {
            time_remain = 1;
        }
   }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 1;
    }
    // Last interval for the '1' signal till 'time till next trigger' elapses
    local_out_gen_config.transitions_durations[number_of_transition-1] = time_remain;
            

    debug_print_bool_array(local_out_gen_config.next_out, "multi shot");
    memcpy(&out_gen_config[data_process_mode], &local_out_gen_config,
           sizeof(out_gen_config_t));
}

void out_gen_config_bulb_expo(cam_trig_state_t data_process_mode, uint32_t bulb_time)
{
    log_printf("%s\n", __func__);
    int32_t time_remain;
    uint32_t number_of_transition = BULB_SHOT_TRANSITIONS;
    uint32_t bulb_time_ticks = MS_TIMER_TICKS_MS((bulb_time*100));

    if(data_process_mode == PIR_IDLE)
    {
        time_remain = MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100)
            - bulb_time_ticks ;
        if((int32_t)time_remain <= 0)
        {
            time_remain = 1;
        }
    }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 0;
    }

    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .done_handler = out_gen_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations = 
            {bulb_time_ticks, time_remain},
        .next_out = { {0, 1, 1},
                      {0, 1, 1} },
    };

    debug_print_bool_array(local_out_gen_config.next_out, "bulb mode");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void out_gen_config_full_video(cam_trig_state_t data_process_mode, uint32_t video_len)
{
    int32_t time_remain;
    video_len = video_len*1000;
    if(data_process_mode == TIMER_IDLE)
    {
        time_remain = config.config_sensepi->timer_conf.timer_interval*100 -
            video_len - VIDEO_START_PULSE -VIDEO_END_PULSE;
    }
    video_len = (time_remain < 0) ?
        (config.config_sensepi->timer_conf.timer_interval*100 - 1000) :
        video_len;
    out_gen_config_t local_out_gen_config =
    {
        .num_transitions = TIMER_VIDEO_TRANSITIONS,
        .next_out = {{0,1,0,1},
            {1,1,1,1}},
        .transitions_durations = {VIDEO_START_PULSE,
                    MS_TIMER_TICKS_MS(video_len),
                    VIDEO_END_PULSE},
        .done_handler = out_gen_done_handler,
        .out_gen_state = data_process_mode,

    };
    debug_print_bool_array(local_out_gen_config.next_out, "Timer video mode");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));

   
}

void out_gen_config_part_video_start(uint32_t video_len)
{
    config_pir.handler = pir_handler_video;
    video_len = video_len * 1000;
    int video_len_check = video_len  - VIDEO_PIR_ON;
    video_len = (video_len_check <= 0) ? 0 : video_len_check;
    out_gen_config_t local_out_gen_config =
    {
        .num_transitions = SINGLE_SHOT_TRANSITIONS,
        .next_out = {{0,1,1}
        ,{1,1,1}},
        .transitions_durations = {VIDEO_START_PULSE, 
                                    (MS_TIMER_TICKS_MS(video_len))},
        .done_handler = out_gen_done_handler,
        .out_gen_state = VIDEO_IDLE,
    };
    debug_print_bool_array(local_out_gen_config.next_out, "PIR video mode");
    memcpy(&out_gen_config[PIR_IDLE],&local_out_gen_config,
           sizeof(out_gen_config_t));    
}

void out_gen_config_part_video_extn (uint32_t extn_len)
{
    video_extn_ticks = MS_TIMER_TICKS_MS(extn_len * 1000);
    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = 1,
        .next_out = {{1,1}, {1,1}},
        .transitions_durations = {video_extn_ticks},
        .done_handler = out_gen_done_handler,
        .out_gen_state = VIDEO_IDLE,
    };
    debug_print_bool_array(local_out_gen_config.next_out, "PIR video extension");
    memcpy(&out_gen_config[VIDEO_ETXN_CONFIG],&local_out_gen_config,
           sizeof(out_gen_config_t));    
    
}

void out_gen_config_part_video_end()
{
    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = SINGLE_SHOT_TRANSITIONS,
        .next_out = {{1,0,1},
            {1,1,1}},
        .transitions_durations = {MS_TIMER_TICKS_MS(VIDEO_PIR_ON), VIDEO_END_PULSE,},
        .done_handler = out_gen_done_handler,
        .out_gen_state = PIR_IDLE,
    };
    debug_print_bool_array(local_out_gen_config.next_out, "PIR video mode");
    memcpy(&out_gen_config[VIDEO_IDLE],&local_out_gen_config,
           sizeof(out_gen_config_t)); 
}

void out_gen_config_focus_only(cam_trig_state_t data_process_mode)
{
    log_printf("%s\n", __func__);
    int32_t time_remain;
    uint32_t number_of_transition = FOCUS_TRANSITIONS;

    if(data_process_mode == PIR_IDLE)
    {
        time_remain =  MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100)
            - SINGLE_SHOT_DURATION ;
        if((int32_t)time_remain <= 0)
        {
            time_remain = 1;
        }
    }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 1;
    }

    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .done_handler = out_gen_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations =
        {SINGLE_SHOT_DURATION ,time_remain},
        .next_out = { {0, 1, 1},
                      {1, 1, 1} },
    };
    
    debug_print_bool_array(local_out_gen_config.next_out, "focus mode");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void out_gen_config_none(cam_trig_state_t data_process_mode)
{
    out_gen_config_t local_out_gen_config =
    {
        .num_transitions = 1,
        .done_handler = out_gen_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations = {1},
        .next_out = { {1},
                      {1} },
    };

    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void sensepi_cam_trigger_init(sensepi_cam_trigger_init_config_t * config_sensepi_cam_trigger)
{
    log_printf("%s\n", __func__);
    ASSERT(config_sensepi_cam_trigger->signal_pin_num == NUM_PIN_OUT);
    memcpy(&config, config_sensepi_cam_trigger, sizeof(config));
    light_sense_init();
    mcp4012_init(config.amp_cs_pin, config.amp_ud_pin, config.amp_spi_sck_pin);
    pir_sense_cfg local_config_pir = 
    {
        PIR_SENSE_INTERVAL_MS, config.pir_sense_signal_input,
        config.pir_sense_offset_input,
        ((uint32_t)config.config_sensepi->pir_conf.threshold)*PIR_THRESHOLD_MULTIPLY_FACTOR,
        APP_IRQ_PRIORITY_HIGH, pir_handler, 
    };
    memcpy(&config_pir, &local_config_pir, sizeof(pir_sense_cfg));
    out_gen_init(NUM_PIN_OUT, config.signal_out_pin_array, 
                 (bool *) out_gen_end_all_on);
}

void sensepi_cam_trigger_update(sensepi_config_t * update_config)
{
    log_printf("%s\n", __func__);
    memcpy(config.config_sensepi, update_config, sizeof(sensepi_config_t));
}

void sensepi_cam_trigger_start()
{
    log_printf("%s\n", __func__);

    if(memcmp (config.config_sensepi, sensepi_store_config_get_last_config(),
               sizeof(sensepi_config_t)) != 0)
    {
        sensepi_store_config_write (config.config_sensepi);
    }
    sense_count = 0;
    sense_feedback = true;
    oper_time_t pir_oper_time = config.config_sensepi->pir_conf.oper_time;
    oper_time_t timer_oper_time = config.config_sensepi->timer_conf.oper_time;
    bool pir_light_flag = true;
    bool timer_light_flag = true;
    if(config.config_sensepi->trig_conf != PIR_ONLY)
    {
        if((timer_oper_time.day_or_night == 1 && timer_oper_time.threshold == 0b0000000)||
        (timer_oper_time.day_or_night == 0 && timer_oper_time.threshold == 0b1111111))
        {
            timer_light_flag = false;
        }
        else
        {
            timer_light_flag = true;
        }      
    }
    else
    {
        timer_light_flag = false;
    }
    if(config.config_sensepi->trig_conf != TIMER_ONLY)
    {
        if((pir_oper_time.day_or_night == 1 && pir_oper_time.threshold == 0b0000000)||
        (pir_oper_time.day_or_night == 0 && pir_oper_time.threshold == 0b1111111))
        {
            pir_light_flag = false;
        }
        else
        {
            pir_light_flag = true;
        }      
    }
    else
    {
        pir_light_flag = false;
    }
    is_light_sense_on = pir_light_flag || timer_light_flag; 

    config_pir.threshold = ((uint32_t) config.config_sensepi->pir_conf.threshold)
            *PIR_THRESHOLD_MULTIPLY_FACTOR;
    config_pir.handler = pir_handler;

    mcp4012_set_value(config.config_sensepi->pir_conf.amplification);

    out_gen_config_updater_timer();
    out_gen_config_updater_pir();

    light_sense_set_state(true);
    module_manager_start_check();
}

void sensepi_cam_trigger_add_tick(uint32_t interval)
{
    static uint32_t light_sense_count = 0;

    log_printf("%s\n", __func__);
    log_printf("SensePi Add ticks : %d\n", interval);

    sense_count += interval;
    if(sense_count > SENSE_FEEDBACK_TIMEOUT_TICKS)
    {
        sense_feedback = false;
    }

    light_sense_count += interval;
    if(light_sense_count > LIGHT_SENSE_INTERVAL_TICKS && sense_feedback == false
       && is_light_sense_on == true)
    {
        module_manager_start_check();
        light_sense_count = (light_sense_count - LIGHT_SENSE_INTERVAL_TICKS);
    }
}

void sensepi_cam_trigger_stop()
{
    log_printf("%s\n",__func__);
    module_manager_disable_all();
    out_gen_stop((bool *) out_gen_end_all_on);
    led_ui_type_stop_all(LED_UI_SINGLE_SEQ);
}

sensepi_config_t * sensepi_cam_trigger_get_sensepi_config()
{
    log_printf("%s\n", __func__);
    return (config.config_sensepi);
}
